#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker]
azurerm_application_insights.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Insights/components/appi-nbn-location-checker]
azurerm_service_plan.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/serverfarms/plan-nbn-location-checker]
azurerm_application_insights.ai01: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Insights/components/appi-nbn-location-checker-01]
azurerm_storage_account.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Storage/storageAccounts/stfuncnbnlocationchecker]
azurerm_storage_container.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content]
azurerm_storage_blob.app: Refreshing state... [id=https://stfuncnbnlocationchecker.blob.core.windows.net/content/294f6253ce792fe9844b4d703cd1734d0cca320d6cfd550416b09a72663df86f.zip]
azurerm_linux_function_app.app: Refreshing state... [id=/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_linux_function_app.app has changed
  ~ resource "azurerm_linux_function_app" "app" {
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker"
        name                              = "func-nbn-location-checker"
      ~ tags                              = {
          - "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=34976fd0-dc61-4cfb-9d1b-6f02d25c271d;IngestionEndpoint=https://australiaeast-0.in.applicationinsights.azure.com/;LiveEndpoint=https://australiaeast.livediagnostics.monitor.azure.com/" -> null
          - "hidden-link: /app-insights-instrumentation-key" = "34976fd0-dc61-4cfb-9d1b-6f02d25c271d" -> null
          - "hidden-link: /app-insights-resource-id"         = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/microsoft.insights/components/appi-nbn-location-checker" -> null
        }
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_function_app.app will be updated in-place
  ~ resource "azurerm_linux_function_app" "app" {
      ~ app_settings                      = {
          ~ "WEBSITE_RUN_FROM_PACKAGE"   = (sensitive)
            # (2 unchanged elements hidden)
        }
        id                                = "/subscriptions/d3deb386-4350-420c-bfdc-ec213c1befcf/resourceGroups/rg-nbn-location-checker/providers/Microsoft.Web/sites/func-nbn-location-checker"
        name                              = "func-nbn-location-checker"
        tags                              = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_blob.app must be replaced
-/+ resource "azurerm_storage_blob" "app" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ id                     = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/294f6253ce792fe9844b4d703cd1734d0cca320d6cfd550416b09a72663df86f.zip" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
      ~ name                   = "294f6253ce792fe9844b4d703cd1734d0cca320d6cfd550416b09a72663df86f.zip" -> "b81375b68359b0859fe0c291ef604bec7d0406e74531d94ef686c76f652d1a2c.zip" # forces replacement
      ~ url                    = "https://stfuncnbnlocationchecker.blob.core.windows.net/content/294f6253ce792fe9844b4d703cd1734d0cca320d6cfd550416b09a72663df86f.zip" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @scottmckenzie, Action: `pull_request`*